clients/grp2/xml/signRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v2="http://mobilityguard.com/grp/service/v2.0/">
   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
   	<wsa:Action soap:mustUnderstand="1">http://mobilityguard.com/grp/service/v2.0/GrpServicePortType/SignRequest</wsa:Action>
	   <wsa:MessageID soap:mustUnderstand="1">uuid:${uuid}</wsa:MessageID>
   </soap:Header>
   <soap:Body>
      <v2:SignRequest>
         <policy>${policy}</policy>
         <provider>${provider}</provider>
         <rpDisplayName>${displayName}</rpDisplayName>
         <subjectIdentifier>${subjectIdentifier}</subjectIdentifier>
         <userVisibleData>${userVisibleData}</userVisibleData>
         <endUserInfo>
            <type>IP_ADDR</type>
            <value>${value}</value>
         </endUserInfo>
      </v2:SignRequest>
   </soap:Body>
</soap:Envelope>